[
    {
        "Title":"Data Scientist",
        "Location":"Pleasanton, CA 94566",
        "Company Name":"Sajix Software Solution Private Limited",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=78e6280457103317&bb=Nm8sqwyT04Wia_3UsmYCTYA7U8sa7KpzE8QPHEHXPeaGvaSwoLGtdppyXdLYnSc7glFAIdWno8-KWwMm_wZ2-CzCV66aIs0Wft-gULfdlggrY9wNLNEmb9HkhkkkY2RqGSajWNKOkLWcIWQPOC46IQ%3D%3D&xkcb=SoDa67M3qk8DXQADNr0LbzkdCdPP&fccid=fa5bbc12d1498bc0&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nR\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nJob type\nInternship\n&nbsp;\nFull job description\nCompany Description\nSajix Inc.\nis a global health-tech company headquartered in Pleasanton, California, focused on transforming healthcare delivery through advanced digital solutions. Since its founding in 2006, Sajix has specialized in developing integrated healthcare information systems that streamline clinical, financial, and administrative operations for healthcare organizations around the world.\nWith operations in the United States, United Kingdom, Singapore, and India, Sajix serves clients across North America, Europe, Asia, and Africa. Its flagship platform,\niHelix\n, is a modular, scalable solution designed for use in diverse healthcare settings—from single-doctor practices to large hospital networks.\nSajix offers a comprehensive suite of digital healthcare solutions, including:\niHelix\nLifeeazy\nAI-based Revenue Cycle Management\n– optimizing financial workflows through automation\nAll products are built with global standards in mind, supporting multiple languages and currencies, and comply with international healthcare regulations such as CCR and CCD.\nThrough strategic partnerships and a commitment to innovation, Sajix continues to lead the industry in delivering intelligent, interoperable, and patient-centric healthcare solutions.\nWebsite:\nwww.sajix.com\nJob Description\nAbout the Role:\nAs a Trainee Data Scientist at Sajix, you will assist in building predictive models and running experiments to derive insights from complex healthcare data.\nKey Responsibilities:\nAssist in cleaning and preprocessing structured and unstructured data.\nSupport the development of statistical and machine learning models.\nParticipate in exploratory data analysis and feature engineering.\nDocument findings and present insights to non-technical stakeholders.\nQualifications\nRequirements:\nBachelor’s or Master’s in Computer Science, Statistics, or Data Science.\nBasic knowledge of Python\/R and libraries like Pandas, Scikit-learn, or NumPy.\nUnderstanding of statistics, probability, and machine learning fundamentals.\nAdditional Information\nThese trainee roles are offered in collaboration with Sajix’s\n__init__py\nprogram—a structured, hands-on learning initiative aimed at nurturing the next generation of full-stack developers and technology professionals. The program offers tiered training tracks.\nParticipants gain real-world experience through live projects, personalized mentorship, and exposure to industry-relevant tools and practices. This collaboration ensures that trainees are well-equipped with practical skills and knowledge to excel in their roles.\nFor more information about the __init__py program, visit initpy.sajix.com.\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"Pleasanton, CA 94566",
        "Company Name":"Sajix",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=a4f3e98fa98cb261&bb=Nm8sqwyT04Wia_3UsmYCTaqJ-mbPN_BVFqrz3E2p8PjK-eNtzKwWpgU2Ffe75aPOJXm6gCXmLyYTG8P-3MKpvFU9Pp77w5VjPdf0KcQ0w7P__6kQHMmQjNW9J7dtfeCjTimGApMVN-f3Gpl_XcR6iA%3D%3D&xkcb=SoBu67M3qk8DXQADNr0KbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nR\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nJob type\nInternship\n&nbsp;\nFull job description\nIntern\nCompany Description\nSajix Inc.\nis a global health-tech company headquartered in Pleasanton, California, focused on transforming healthcare delivery through advanced digital solutions. Since its founding in 2006, Sajix has specialized in developing integrated healthcare information systems that streamline clinical, financial, and administrative operations for healthcare organizations around the world.\nWith operations in the United States, United Kingdom, Singapore, and India, Sajix serves clients across North America, Europe, Asia, and Africa. Its flagship platform,\niHelix\n, is a modular, scalable solution designed for use in diverse healthcare settings—from single-doctor practices to large hospital networks.\nSajix offers a comprehensive suite of digital healthcare solutions, including:\niHelix\nLifeeazy\nAI-based Revenue Cycle Management\n– optimizing financial workflows through automation\nAll products are built with global standards in mind, supporting multiple languages and currencies, and comply with international healthcare regulations such as CCR and CCD.\nThrough strategic partnerships and a commitment to innovation, Sajix continues to lead the industry in delivering intelligent, interoperable, and patient-centric healthcare solutions.\nWebsite:\nwww.sajix.com\nJob Description\nAbout the Role:\nAs a Trainee Data Scientist at Sajix, you will assist in building predictive models and running experiments to derive insights from complex healthcare data.\nKey Responsibilities:\nAssist in cleaning and preprocessing structured and unstructured data.\nSupport the development of statistical and machine learning models.\nParticipate in exploratory data analysis and feature engineering.\nDocument findings and present insights to non-technical stakeholders.\nQualifications\nRequirements:\nBachelor’s or Master’s in Computer Science, Statistics, or Data Science.\nBasic knowledge of Python\/R and libraries like Pandas, Scikit-learn, or NumPy.\nUnderstanding of statistics, probability, and machine learning fundamentals.\nAdditional Information\nThese trainee roles are offered in collaboration with Sajix’s\n__init__py\nprogram—a structured, hands-on learning initiative aimed at nurturing the next generation of full-stack developers and technology professionals. The program offers tiered training tracks.\nParticipants gain real-world experience through live projects, personalized mentorship, and exposure to industry-relevant tools and practices. This collaboration ensures that trainees are well-equipped with practical skills and knowledge to excel in their roles.\nFor more information about the __init__py program, visit initpy.sajix.com.\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"Pleasanton, CA 94566",
        "Company Name":"Sajix",
        "Link":"https:\/\/www.indeed.com\/viewjob?jk=cdef0123456789ab",
        "Description":"REQUEST ERROR: 404 Client Error: Not Found for url: https:\/\/www.indeed.com\/viewjob?jk=cdef0123456789ab"
    },
    {
        "Title":"Data Scientist (Tapestry)",
        "Location":"Mountain View, CA",
        "Company Name":"Loon",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=8bb8e7ae29b531f3&bb=Nm8sqwyT04Wia_3UsmYCTfgSKN9frHY68A-QCbfFmpRzW-2uL7Bdaf2VseVgzTS6GJb_xkfL1fEz3amG9Skk1wj6YpCRkdnoOD20UkAcd7B08iFUSfFU71KWH74pfYpocIJvb_YR2T01c8UwkUh6BA%3D%3D&xkcb=SoDz67M3qk8DXQADNr0JbzkdCdPP&fccid=d2776a31bd03907b&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistics\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$166,000 - $259,000 a year\nJob type\nFull-time\n&nbsp;\nFull job description\nSoftware EngineeringMountain View, CA (HQ)\nAbout the team:\nTapestry is X’s moonshot for the electric grid. We’re transforming how the world makes, moves and uses electricity, using AI to reshape energy on a global scale.\nWe’re looking for curious minds who want to be a part of this extraordinary moment in energy. You would be joining a multidisciplinary team from a wide variety of experiences and backgrounds—from AI and power systems experts to software engineers and energy entrepreneurs– working together to realize Tapestry’s mission to make the grid visible so that everyone, everywhere can access reliable, abundant, and clean energy.\nTapestry is incubating at X, Alphabet’s Moonshot Factory—the birthplace of breakthrough technologies like Waymo and Google Brain. At Tapestry, you’ll have the chance to be part of a rapidly growing team that has the agility and impact of an early stage company with the resources and technical excellence of Alphabet. If developing multimodal AI solutions gets you up in the morning and load growth challenges keep you up at night, we'd love to meet you.\nLearn more about our team and our mission here.\nAbout the role\nAt Tapestry, data drives all our decision-making. Data Scientists work all across the organization to help shape our business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical excellence and statistical methods, you mine through data to identify opportunities for Tapestry and our partners to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As a Data Scientist, you do more than just crunch the numbers.\nHow you’ll make 10x impact:\nApply the latest in data science techniques to build and deploy data pipelines and exploratory data analysis on large-scale datasets\nTest and develop new techniques to pull forward critical insights and communicate them clearly to a diverse group of stakeholders\nWork with large datasets and solve difficult analysis problems, applying advanced analytical methods. Conduct end-to-end analyses, including data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.\nBuild and prototype analysis pipelines iteratively to provide insights at scale.\nMake business recommendations with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.\nResearch and develop analyses and forecasting and optimization methods across search quality, end-user behavioral modeling, and live experiments.\nWhat you should have:\nPhD or Master’s in a quantitative field and 5+ years of tech or energy industry work experience as a statistician, quantitative analyst, or data scientist. Experience in statistical data analysis, such as linear models, multivariate analysis, stochastic models, and sampling methods.\nExperience in Machine Learning and Deep Learning\nFluency in Python and SQL\nExperience with cloud hosting services and storage of both unstructured and structured data\nExperience with processing live data streams, including sampling, synchronization, and quantification\nExperience with electric power grid data, and physics based understanding of electrical networks and utility data\nApplied experience with machine learning on large datasets.\nExperience articulating business questions and using mathematical techniques to arrive at an answer using available data.\nExperience building compelling data visualization (such as dashboards)\nAbility to select the right statistical tools given a data analysis problem.\nExperience in managing a diverse team and work cross functions.\nExperience working with software engineering teams to build ML-powered systems ready for production\nExpertise in computer vision models, time series forecasting or LLMs’\nExperience building comprehensive model evaluation tooling and processes\nIt’d be great if you had these:\nThrive on ambiguity, setting own goals and effectively delivering to them in a very fast-changing environment\nAbility to influence without authority, working with technical and cross-functional teams who do not report into this role to get things done\nDistinctive problem solving and analysis skills, combined with impeccable business judgment, leadership skills, and ability to communicate with a senior management team\nAttention to detail, project management, and organizational skills\nFast learner with capacity to learn about a wide-spread of different technologies &amp; industries\nPassion for the energy and climate space\nThe US base salary range for this full-time position is $166,000 - $259,000 + bonus + equity + benefits. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your location during the hiring process.\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits.\nAn Equal Opportunity Workplace\nAt X, we don't just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. We are proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\nIf you have a disability or special need that requires accommodation, please contact us at x-accommodation-request@x.team.\n&nbsp;"
    },
    {
        "Title":"Research Scientist, Foundation Model (LLM)",
        "Location":"San Jose, CA",
        "Company Name":"ByteDance",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=780362905ef9d64a&bb=Nm8sqwyT04Wia_3UsmYCTf92pgpkrXRARME5VczztbVNkKNhumJOwGeyZXB13O7hNU00BJ7n1bhvp1zgRZ0jnyeUX7qxWoWJhgRvtoAGkbDHoYjZu-UM1_OXzfsPCaE3H2We2ACaJo15fUBDAWWmrQ%3D%3D&xkcb=SoBH67M3qk8DXQADNr0IbzkdCdPP&fccid=74fbc768a4e5bece&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nSoftware coding\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$136,800 - $359,720 a year\nEncouraged to apply\nFair chance\n&nbsp;\nBenefits\nPulled from the full job description\nPaid parental leave\nParental leave\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nPaid sick time\nShow more\nchevron down\n&nbsp;\nFull job description\nLocation:\nSan Jose\nTeam:\nAlgorithm\nEmployment Type:\nRegular\nJob Code:\nA110702\nResponsibilities\nWith a long-term vision and a strong commitment to the AI field, the Team conducts research in a range of areas including natural language processing (NLP), computer vision (CV), and speech recognition and generation. It boasts a robust international presence with labs and research facilities in China, Singapore, and the US. Leveraging substantial data and computing resources and through continued investment in these domains, our team has built a proprietary general-purpose model with multimodal capabilities. This model supports over 50 downstream business services including Doubao, Coze, and Dreamina, which are available to enterprise customers via the Volcano Engine. Currently, the Doubao App is the most used AIGC application in the China market.\nResponsibilities\nThe main job directions include:\n1. Explore large-scale models and optimize systems to the extreme;\n2. Data construction, instruction tuning, preference alignment, and model optimization;\n3. Implementation of relevant applications, including content generation, reasoning, code generation, etc.;\n4. In-depth research and exploration of more usage scenarios in future life.\nQualifications\nMinimum Qualifications\n1. Excellent coding ability, data structures, and fundamental algorithm skills, proficient in C\/C++ or Python, winners of competitions such as ACM\/ICPC, NOI\/IOI, Top Coder, Kaggle, etc. are preferred;\n2. Familiar with NLP, CV-related algorithms, technologies, and familiar with large-scale model training and RL algorithms are preferred;\n3. Candidates who have led influential projects or papers in the field of large-scale models are preferred;\n4. Excellent problem analysis and solving skills, able to deeply solve problems in large-scale model training and application;\n5. Good communication and collaboration skills, able to explore new technologies with the team and promote technological progress.\n#LI-Onsite\nJob Information\n【For Pay Transparency】Compensation Description (Annually)\nThe base salary range for this position in the selected city is $136800 - $359720 annually.\nCompensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of the Total Package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses\/incentives, and restricted stock units.\nBenefits may vary depending on the nature of employment and the country work location. Employees have day one access to medical, dental, and vision insurance, a 401(k) savings plan with company match, paid parental leave, short-term and long-term disability coverage, life insurance, wellbeing benefits, among others. Employees also receive 10 paid holidays per year, 10 paid sick days per year and 17 days of Paid Personal Time (prorated upon hire with increasing accruals by tenure).\nThe Company reserves the right to modify or change these benefits programs at any time, with or without notice.\nFor Los Angeles County (unincorporated) Candidates:\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all federal, state, and local laws including the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act. Our company believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of the conditional offer of employment:\n1. Interacting and occasionally having unsupervised contact with internal\/external clients and\/or colleagues;\n2. Appropriately handling and managing confidential information including proprietary and trade secret information and access to information technology systems; and\n3. Exercising sound judgment.\nAbout Doubao (Seed)\nFounded in 2023, the ByteDance Doubao (Seed) Team, is dedicated to pioneering advanced AI foundation models. Our goal is to lead in cutting-edge research and drive technological and societal advancements.\nWith a strong commitment to AI, our research areas span deep learning, reinforcement learning, Language, Vision, Audio, AI Infra and AI Safety. Our team has labs and research positions across China, Singapore, and the US.\nWhy Join ByteDance\nInspiring creativity is at the core of ByteDance's mission. Our innovative products are built to help people authentically express themselves, discover and connect – and our global, diverse teams make that possible. Together, we create value for our communities, inspire creativity and enrich life - a mission we work towards every day.\nAs ByteDancers, we strive to do great things with great people. We lead with curiosity, humility, and a desire to make impact in a rapidly growing tech company. By constantly iterating and fostering an \"Always Day 1\" mindset, we achieve meaningful breakthroughs for ourselves, our Company, and our users. When we create and grow together, the possibilities are limitless. Join us.\nDiversity & Inclusion\nByteDance is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At ByteDance, our mission is to inspire creativity and enrich life. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\nReasonable Accommodation\nByteDance is committed to providing reasonable accommodations in our recruitment processes for candidates with disabilities, pregnancy, sincerely held religious beliefs or other reasons protected by applicable laws. If you need assistance or a reasonable accommodation, please reach out to us at https:\/\/tinyurl.com\/RA-request\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"Santa Clara, CA",
        "Company Name":"NutaNXT Technologies",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=2ad5b66e52509d34&bb=Nm8sqwyT04Wia_3UsmYCTWiQ79NXgxpbEjS2dkQLe4nc4aWDxATtiOBlM6XfltWtlMASTIL8rbxmU7X9mRKnP5zQlxfNoIGHjs0gsmz6SpVyZeSbGMxbU6GKWgn-8rEvTnPVSnqV5hRR85FSRGtztg%3D%3D&xkcb=SoDJ67M3qk8DXQADNr0PbzkdCdPP&fccid=5f07c644625147e2&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nTableau\n?\nYes\nNo\n&nbsp;\nFull job description\nJob Description\nAs a Data Scientist, you will help healthcare run efficiently through AI models that improve the distribution and manufacturing of healthcare products. You will understand key problems faced by business partners across the business, and ask good questions. You will brainstorm possible statistical solutions with help from Senior Data Scientists. You will own AI experiments, failing fast and pivot to the right solution. Finally, you will operationalize models with help from Senior Machine Learning Engineers.\nResponsibilities\nExtract data from multiple data sources like Microsoft SQL Server, Oracle, Azure Blob, and Azure SQL using SQL or Python\nInterpret data well and study patterns using Python libraries like Pandas, Seaborn, and Matplotlib Present findings in clean analysis and visualization to stakeholders\nPresent findings in Tableau in a way that compels and enables decision-makers.\nConduct machine learning experiments using libraries like scikitlearn, tensorflow or spark mllib\nPackage models to be consumed in enterprise setting through APIs Test and troubleshoot production models as needed\nHelp with production release, migration testing, etc. as needed\nPerform basic Image and Spectral data processing for data preparation\nBuild standalone and integration ready modules and packages for solution\nQualifications\nSelf-starter with good communication skills\nProficient in Python – Pandas, Seaborn and Matplotlib\nSkilled in Tableau Visualization\nExcellent knowledge of SQL ( Handling Nulls, Joins, Unions, Case, Date Time Manipulation, String Formatting)\nGood knowledge in Excel based data analysis (Graphs, Charts, Pivots, Lookups and Statistical Functions)\nKnowledge of Scikitlearn, Tensor flow, or Spark mllib\nMust be able to demonstrate skills through any public channel like GitHub , own website\/blog, or Tableau Public\nKnowledge of structured, unstructured and other data formats\/sources\nSkilled in building basic RESTful APIs and documentation\nOver 2 years of experience as Data Scientist\nOver 3 years of experience as BI\/Data Analyst\nOver 3 years of experience with Python, SQL and Tableau\nSEND US YOUR RESUME AT CAREERS@NUTANXT.COM\n&nbsp;"
    },
    {
        "Title":"Data Scientist (Dublin, CA)",
        "Location":"Hybrid work in Dublin, CA 94568",
        "Company Name":"SavvyMoney",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=f33e369c3117285c&bb=Nm8sqwyT04Wia_3UsmYCTZ-Bq9qWkabDltKQ81yjHc3ZEshTXyvK6SZCNv7YmFMjugGK5OHg_G4xzAxG2A_JsLaoWSpP9au3sqG_6N49vGEf-xkOKCK09btSWSfQhtj0A9-v4_o9JIhAw69RiT9pYQ%3D%3D&xkcb=SoB967M3qk8DXQADNr0ObzkdCdPP&fccid=2ec06d11eaa11c3f&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistics\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$160,000 - $185,000 a year\nJob type\nFull-time\n&nbsp;\nBenefits\nPulled from the full job description\n401(k)\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\n&nbsp;\nFull job description\nData Scientist\n(Dublin, CA)\nSavvyMoney is a leading San Francisco East Bay fintech company. We provide integrated credit score and personal finance solutions to 1,500 + bank and credit union partners nationally. The SavvyMoney solutions integrate with more than 43 digital banking platforms.\nSavvyMoney was recently recognized by the San Francisco Business Times and the Silicon Valley Journal as one of the \"Top 25 Places to Work in the San Francisco Bay Area\" and is an Inc. 5000 Fastest Growing Company.\nWe’re headquartered in Dublin, CA, and offer a flexible hybrid work environment that blends in-office collaboration with the freedom of remote work.\nWe are seeking a\nseasoned Data Scientist\nto join our team and lead initiatives in predictive modeling, personalization, and AI-driven financial recommendations. This individual will play a key role in building models that power personalized marketing, loan offers, credit improvement strategies, and next-best-action recommendations.\nThe role requires expertise in data analysis to uncover business opportunities, traditional machine learning methods (tree-based models, neural networks) and emerging techniques, including Large Language Models (LLMs). You will collaborate closely with engineering to deploy models into scalable, low-latency production environments, as well as work with business and product stakeholders to generate ad-hoc analytics and actionable insights.\nResponsibilities\nPerform exploratory and statistical data analysis to identify opportunities for model development and business optimization\nDesign, build, and optimize machine learning models for:\nMarketing propensity modeling\nPersonalized loan offers and recommendations\nNext-best-action predictions for improving credit scores\nPrototype solutions using advanced AI techniques to accelerate experimentation\nPartner with engineering teams to productionize models in a scalable and latency-conscious environment\nQuery and analyze large datasets to uncover business insights and support decision-making\nCollaborate with business and product stakeholders to define problems, scope analyses, and deliver ad-hoc reports and dashboards\nDevelop reusable frameworks, pipelines, and tools to accelerate model development and deployment\nDocument methodologies, models, and assumptions to ensure clarity, reproducibility, and knowledge sharing\nFollow ethical AI principles and established guardrails to ensure fairness, transparency, and unbiased predictions.\nExperience\nMaster’s or PhD in Computer Science, Statistics, Data Science, or related field (or equivalent experience)\n6+ years of professional experience in data science or machine learning, ideally in fintech, financial services, or a B2B2C environment\nStrong proficiency in SQL and Python (pandas, scikit-learn, PyTorch, TensorFlow, XGBoost, etc.)\nHands-on experience with tree-based models (XGBoost, LightGBM, CatBoost) and neural networks\nProficiency in notebooks (Jupyter, Colab, etc.) and deep learning frameworks such as TensorFlow and PyTorch for model development\nFamiliarity with LLMs and generative AI frameworks (HuggingFace, LangChain, OpenAI APIs, etc.)\nExperience deploying machine learning models into production environments with considerations for scalability and latency\nStrong business acumen with the ability to translate complex analytical outputs into actionable recommendations\nExcellent communication skills to collaborate with both technical and non-technical stakeholders\nPreferred Experience\nExperience with cloud-based platforms (AWS, GCP, or Azure) for model training and deployment\nKnowledge of MLOps tools and practices (MLflow, Airflow, Kubeflow, Docker, etc.)\nUnderstanding of credit risk modeling, financial products, or consumer lending.\nExperience working with APIs, real-time scoring, and event-driven architectures.\nWhy Join Us?\nHigh Impact: Your models will directly shape how people access loans, improve credit scores, and receive personalized financial recommendations\nInnovation-First Culture: From tree-based models to neural networks and LLMs, you’ll have the freedom to prototype with state-of-the-art techniques and put them in action\nCross-Functional Collaboration: Work closely with product, engineering, and business leaders to take ideas from prototype to production.\nMission-Driven: Help democratize financial wellness and unlock opportunities for millions.\nBase Salary\nThe annual base salary for this position is between $160,000 to $185,000 depending upon experience.\nAdditionally we provide\nAnnual Bonus potential\nEquity compensation package\nFlexible Time Off Policy (Take time as you need it)\n401(k) with Employer contribution\nMedical, Dental, Vision – 100% premium paid for employee\nOpportunity for career growth and challenge\nBeautiful California East Bay offices in Dublin, CA\nSavvyMoney’s EEO Statement\nSavvyMoney relies on diversity of culture and thought to deliver on our goal of Creative People, Practical solutions serving our client needs, and ensures nondiscrimination in all programs and activities. We continuously seek talented, qualified employees in our operations regardless of race, color, sex\/gender, including gender identity and expression, sexual orientation, pregnancy, national origin, religion, disability, age, marital status, citizen status, protected veteran status, or any other protected classification under country or local law. SavvyMoney is proud to be an Equal Employment Opportunity\/ Affirmative Action Employer.\nWe are committed to protecting your data. To learn more, please review the SavvyMoney Employee Privacy Policy Notice here\n&nbsp;"
    },
    {
        "Title":"Machine Learning Engineer",
        "Location":"Hybrid work in Santa Clara, CA 95050",
        "Company Name":"Edurech Technoogy",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=54d0e2fb38ac1bbb&bb=Nm8sqwyT04Wia_3UsmYCTfa66GUDG-4SfvbSE8yLfHqCfPdTKTTKMkFtnxo8kf3AscVprKIJS9A_lEGrf7I_uSOwfxmH2KLhZJcicxzh1u_hYV1nVHlo7ZIr8qxDxrdQa1ssDiAZrEan22jSC96wXQ%3D%3D&xkcb=SoDg67M3qk8DXQADNr0NbzkdCdPP&fccid=090eca2ba51f48b6&cmp=Edurech-Technoogy&ti=Machine+Learning+Engineer&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nUnsupervised learning\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$119,602.25 - $144,037.13 a year\nJob type\nFull-time\n&nbsp;\nBenefits\nPulled from the full job description\nProfessional development assistance\nTuition reimbursement\n401(k)\nHealth insurance\n401(k) matching\nPaid time off\nVision insurance\nShow more\nchevron down\n&nbsp;\nFull job description\nJob Summary\nWe are seeking a skilled Machine Learning Engineer to join our dynamic team. The ideal candidate will have a strong background in machine learning, data mining, and analytics, with experience in developing and deploying machine learning models. You will work closely with data scientists and software engineers to create innovative solutions that leverage AI technologies. This role requires proficiency in various programming languages and frameworks, as well as a solid understanding of big data technologies.\nResponsibilities\nDesign, develop, and implement machine learning models and algorithms for various applications.\nCollaborate with cross-functional teams to understand business requirements and translate them into technical specifications.\nConduct data mining and analysis to extract insights from large datasets.\nUtilize machine learning frameworks such as TensorFlow, Spark, and SAS for model training and deployment.\nImplement ETL processes for data preparation and integration from multiple sources.\nOptimize existing models for performance and scalability in production environments.\nEngage in continuous learning to stay updated with the latest advancements in AI and machine learning technologies.\nDocument processes, methodologies, and findings to ensure knowledge sharing within the team.\nExperience\nProficiency in programming languages such as Python, Java, C, and R.\nHands-on experience with machine learning frameworks (e.g., TensorFlow, Spark) and tools (e.g., Hadoop).\nFamiliarity with database design and SQL for data manipulation.\nKnowledge of unsupervised learning techniques and natural language processing (NLP).\nExperience with big data technologies such as AWS, Hadoop, or Talend is highly desirable.\nUnderstanding of linked data concepts and analytics tools like Looker.\nFamiliarity with scripting languages such as Bash (Unix shell) or VBA is a plus.\nBackground in quantum engineering or advanced analytics is an advantage. Join us to be part of an innovative environment where your skills will contribute to cutting-edge projects that shape the future of technology.\nJob Type: Full-time\nPay: $119,602.25 - $144,037.13 per year\nBenefits:\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nProfessional development assistance\nTuition reimbursement\nVision insurance\nAbility to Commute:\nSanta Clara, CA 95050 (Required)\nAbility to Relocate:\nSanta Clara, CA 95050: Relocate before starting work (Required)\nWork Location: Hybrid remote in Santa Clara, CA 95050\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"Hybrid work in Pleasanton, CA 94566",
        "Company Name":"Flex Employee Services",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=18dd050faef8e6f8&bb=Nm8sqwyT04Wia_3UsmYCTX2wb9P0erbg06rfIm2Z5wLRQKta9xagzI0ulEZ1Isb3Q6hDF7p_dPAhP0vJRdxySqmvkrwJro3y3yGdALFu31N23K9us03-zlBwlBF5RLjcqA4vgUia1No2eKMUJse3Ig%3D%3D&xkcb=SoBU67M3qk8DXQADNr0MbzkdCdPP&fccid=77cc9c74b065ea92&cmp=Flex-Employee-Services&ti=Data+Scientist&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nSpark\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\nUp to $49 an hour\nJob type\nContract\nWork setting\nHybrid work\n&nbsp;\nFull job description\nDescription\nAs a Data Scientist Contractor, you will analyze complex data sets to extract meaningful insights and support data-driven decision-making.\nCollect, process, and analyze large datasets to identify trends, patterns, and insights.\nDevelop and implement machine learning models and algorithms to solve business problems.\nCreate data visualizations and dashboards to communicate findings to stakeholders.\nCollaborate with project teams to understand data requirements and deliver relevant analytical solutions.\nEnsure data accuracy and integrity by performing data validation and quality checks.\nJob Overview:\nWe are seeking a skilled Data Engineer with hands-on Databricks experience to design, build, and optimize large-scale data pipelines and analytics solutions. You will work with cross-functional teams to enable scalable data processing using the Databricks Lakehouse Platform on Azure.\nKey Responsibilities:\nDesign and implement ETL\/ELT pipelines using Databricks, Delta Lake, and Apache Spark\nCollaborate with data scientists, analysts, and stakeholders to deliver clean, reliable, and well-modeled data\nBuild and manage data workflows with Databricks Jobs, Notebooks, and Workflows\nOptimize Spark jobs for performance, reliability, and cost-efficiency\nMaintain and monitor data pipelines, ensuring availability and data quality\nImplement CI\/CD practices for Databricks notebooks and infrastructure-as-code (e.g., Terraform, Databricks CLI)\nDocument data pipelines, datasets, and operational processes\nEnsure compliance with data governance, privacy, and security policies\nPrimary Skill Required for the Role:\nDatabricks Architect\nQualifications:\nBachelor’s or Master’s in Computer Science, Data Engineering, or a related field\n5+ years of experience in data engineering or a similar role\nStrong hands-on experience with Databricks and Apache Spark (Python, Scala, or SQL)\nProficiency with Delta Lake, Unity Catalog, and data lake architectures\nExperience with cloud platforms (Azure, AWS, or GCP), especially data services (e.g., S3, ADLS, BigQuery)\nFamiliarity with CI\/CD pipelines, version control (Git), and job orchestration tools (Airflow, DB Workflows)\nStrong understanding of data warehousing concepts, performance tuning, and big data processing\nPreferred Skills:\nExperience with MLflow, Feature Store, or other machine learning tools in Databricks\nKnowledge of data governance tools like Unity Catalog or Purview\nExperience integrating BI tools (Power BI, Tableau) with Databricks\nDatabricks certification(s) (Data Engineer Associate\/Professional, Machine Learning, etc.)\nLevel Required for Primary Skill:\nAdvanced (6-9 years experience)\nJob Type: Contract\nPay: Up to $49.00 per hour\nExpected hours: No less than 40 per week\nApplication Question(s):\nAre you comfortable working on W2?\nAre you legally authorized to work in the United States, US Citizen\/Green Card Holder?\nAre you willing to work on a contract to hire basis?\nHow many years of work experience do you have with Azure Databricks?\nHow many years of work experience do you have in data engineering or a similar role?\nHow many years of work experience do you have with Apache Spark?\nHow many years of work experience do you have with Python, Scala, or SQL?\nAre you proficient in Delta Lake, Unity Catalog, and data lake architectures?\nHow many years of experience do you have with cloud platforms (Azure, AWS, or GCP), especially data services (e.g., S3, ADLS, BigQuery)?\nHow many years of experience do you have with data warehousing concepts, performance tuning, and big data processing?\nWork Location: Hybrid remote in Pleasanton, CA 94566\n&nbsp;"
    },
    {
        "Title":"Machine Learning Engineer",
        "Location":"Santa Clara, CA",
        "Company Name":"Amiri Recruiting",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=674087e716231b3c&bb=Nm8sqwyT04Wia_3UsmYCTUithzXaEjMfblbhElgPsExqOAl1t_WKrbSSyimJGq9h5_TldIFX0EpICewuHyrKxD8CkNGQYUNmC-Q_9XVayriiOh1lfAhoIPot31lDtWRdpsfzJ_-m7tndNl-uKUm9tA%3D%3D&xkcb=SoC967M3qk8DXQADNr0DbzkdCdPP&fccid=dd616958bd9ddc12&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nSoftware development\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$140,000 - $220,000 a year\nJob type\nFull-time\nShift and schedule\nMonday to Friday\n&nbsp;\nFull job description\nMachine Learning Engineer\nThis is an opportunity with an early stage startup.(M-F, in Mountain View, CA)\nAbout the Role\nWe're looking for an ML research-focused software engineer to join us on our mission to build AI superpowers for developers.\nWhat you'll do\nTrain and fine-tune large language models\nNavigate high levels of uncertainty and prioritize high-value ML experiments to maximize product impact\nDemonstrate initiative and the ability to start and make progress on projects independently\nSwiftly design, track, and analyze experiments results. Meticulously document findings, conduct ablation studies, and synthesize data into actionable insights.\nParticipate in the ML reading group and level up the team's knowledge of LLM training and infrastructure\nAbout you\nStrong software engineering skills. There are no pure research scientists at the company.\nStrong grasp of the feasibility frontier of CS, AI, and LLMs, from H100 bandwidth to GPT-4 capabilities to vector database performance.\nDeep curiosity about the code generation problem. Willingness to constantly re-examine priors in the face of new discoveries.\nSkilled in transforming successful experimental outcomes into robust, scalable features for the core product offering\nExperience training and iterating on large production neural networks in any domain (self-driving, language models, etc.) is a strong plus\nFamiliarity with AI-powered developer tools like Copilot, ChatGPT, and others is a strong plus\nWhat we believe\nOur best work is done in person. The team goes in 5 days a week into our office in downtown Mountain View, CA (within walking distance of the Caltrain station).\nResearch is in service of a better product. While we read many papers, we won't have time to write them. The best AI researchers have excellent software engineering skills and know that infrastructure and evaluation work are critical.\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"San Jose, CA 95110(Downtown area)",
        "Company Name":"Quantiply Corporation",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=bad40162885ca898&bb=Nm8sqwyT04Wia_3UsmYCTZIxCqAw4T1jhR28o-aaObG2MZnBwesT-2O2jKpMCEsTefxwZ793-Q9B-zoqrVQvBKm5hHVz9pPmdj2mzfQ0JCTDjNJ0kcfzL6JehsoJukjuct3BJOiQWrAfhdjliig2cw%3D%3D&xkcb=SoAJ67M3qk8DXQADNr0CbzkdCdPP&fccid=37528b4eee414335&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistics\n?\nYes\nNo\nEducation\nDo you have a\nDoctoral degree\n?\nYes\nNo\n&nbsp;\nFull job description\nCompany Description\nDid you know that Money Laundering is a primary enabler of criminal activity like drug trafficking, smuggling, terrorism, and corruption around the world with an estimated $2.3 Trillion laundered annually? Criminals are becoming more and more sophisticated in rapidly innovating new ways to launder money and current methods of detecting money laundering are antiquated and ineffective. Quantiply’s Sensemaker application suite and platform solutions use AI and machine learning algorithms to identify money laundering and other criminal activities and automatically recommend mitigation strategies and actions. If you are looking for an opportunity to work on complex business problems using the latest AI and Machine Learning technologies, work with best and brightest in crafting innovative solutions while making a positive impact on society, Quantiply is the place for you.\nJob Description\nIn this role, you will be part of a brand new, trend setting Cognitive Intelligence team which is applying Machine learning and AI to solve complex, business critical problems in the financial services industries.\nThis position within the Cognitive Intelligence team presents a unique and rare opportunity to get in on the ground floor within a fast-growing business and help shape the technology, product, and business. As a real-time transactional intelligence service, our solutions have to be scalable, secure, efficient, and extremely fault-tolerant.\nA successful candidate will bring: deep technical and software expertise; ability to define visionary, ground breaking products; desire to have an industry-wide impact; and an ability to work within a fast moving, startup environment to rapidly deliver services that drive broad business impact.\nResponsibilities:\nApply your expertise in designing, implementing and validating unsupervised deep learning, reinforcement learning and bayesian models.\nPresent exploratory findings to both, technical and management teams, verbally and in writing.\nPartner with Product and Engineering teams to explore new opportunities.\nEngage in collaborating across team members to meet research and product goals.\nInfluence product features and product roadmap through exploratory analysis.\nQualifications\nMinimum qualifications:\nPhD in machine learning, statistics, computer science, neuroscience, bioinformatics, game theory or equivalent practical experience.\nStrong knowledge of machine learning and statistics.\nStrong knowledge of designing algorithms.\nSome experience in Python and Tensorflow.\nPreferred qualifications:\nStrong knowledge of deep learning.\nStrong knowledge of reinforcement learning.\nStrong experience in Tensorflow or similar frameworks.\nWorking experience in C++.\nAdditional Information\nAll your information will be kept confidential according to EEO guidelines.\n&nbsp;"
    },
    {
        "Title":"Data Scientist",
        "Location":"Santa Clara, CA 95050",
        "Company Name":"CLARA analytics",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=05616dd022dc6f64&bb=Nm8sqwyT04Wia_3UsmYCTeHhFFvMwsNnRDNy0VQeEFRicX_Wa5Ai0m8ytTUf8j7OnjN1aOqJ2wQYYtE6g2dq4AFL7UaL4Cg_8Ydv2G5-c9Aj9f6HN4yM-V1og2uzZusFvz3rij1lT4k1-LtvTlVPbQ%3D%3D&xkcb=SoCU67M3qk8DXQADNr0BbzkdCdPP&fccid=19486b46783ccb37&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistics\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nFull job description\nCompany Description\nAt CLARA analytics we build AI-based InsurTech products that help workers’ compensation claims examiners get in front of their claims through easy-to-use AI and machine learning. Our CLARA Claims product helps claims managers focus their teams’ efforts, while CLARA Providers helps connect the injured worker to the right doctor fast. While there is deep data science behind these solutions, they are packaged in easy-to-use formats that can start delivering value in a few months.\nJob Description\nCLARA analytics is looking for extraordinary data scientists to synthesize and leverage ever-growing datasets to help radically transform the operational performance in the workers’ compensation sector.\nThe Data Scientist role involves working on all stages of the data science pipeline, from acquiring and assessing data, selecting appropriate models and algorithms and\/or deriving custom algorithms, testing and evaluating these algorithms and models, and incorporating them into a commercial product. She\/He will work with a team of Data Scientists to create bleeding edge analytic technology.\nThis is a chance to get in early with a rapidly growing Silicon Valley company, and to participate in developing the next generation of truly game-changing, healthcare-related products. Job title and compensation will be adjusted as appropriate to meet the experience level of the right candidate.\nQualifications\nKey Responsibilities\nAnalyze various data sets and build sophisticated mathematical\/statistical models\nDesign and optimize algorithms to achieve the best solutions\nCollaborate with product management and engineering departments to understand company needs and devise possible solutions\nKeep up-to-date with latest technology trends\nCommunicate results and ideas to key decision makers\nImplement new statistical or other mathematical methodologies as needed for specific models or analysis\nParticipate in product ideation sessions, roadmap reviews and customer calls as needed.\nQualifications & Experience\nStrong quantitative and analytical skills with an advanced degree in a STEM discipline (Masters required, PhD preferred)\nExperience using at least two of the following: R, Python, C, C++, SQL, Java. (Experience with Spark\/Scala a plus.)\nExperience defining research hypotheses, analyzing data sets, engineering features and building machine learning mathematical\/statistical models and\/or optimization algorithms\nAbility to communicate complex quantitative analysis results in a clear, precise, and actionable manner using a variety of presentation tools including Excel, PowerPoint, etc.\nAbility to work collaboratively and independently.\nPersonal Characteristics\nA passion for data science and problem-solving in general\nSelf-driven individual who can take a high level idea and see it through to completion with minimal supervision\nThe desire and ability to work in a fast-paced, start-up atmosphere\nTakes a pragmatic approach to problem-solving, combined with the ability to thrive under the pressure of constant change and moving objectives\nAbility to work under tight deadlines and display grace under pressure\nWillingness to learn about the industry we serve\nExcellent organizational, interpersonal, and communication skills (both written and verbal).\nAdditional Information\nAt CLARA analytics, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n&nbsp;"
    },
    {
        "Title":"Data Scientist, Metrics Team",
        "Location":"San Jose, CA 95134(North San Jose area)",
        "Company Name":"WeRide.ai",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=813d0dfa0e518abb&bb=Nm8sqwyT04Wia_3UsmYCTUE51JeS8iyT7I7vvCbIdH02o86rfuArRvDzf-WtuWoxBH2saA2-NSa1CPChkujULRid8sBEKc5q8FfHY9bh4wlN6J4RBWNyBLw_-2TasLB5_qlmi3jVRUcZs9w5k08SGw%3D%3D&xkcb=SoAg67M3qk8DXQADNr0AbzkdCdPP&fccid=a7081d2f52016a53&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistical modeling\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$130,000 - $182,000 a year\nJob type\nFull-time\n&nbsp;\nBenefits\nPulled from the full job description\nFood provided\n401(k)\nHealth insurance\nDental insurance\nPaid holidays\n&nbsp;\nFull job description\nEstablished in 2017, WeRide (NASDAQ: WRD) is a leading global commercial-stage company that develops autonomous driving technologies from Level 2 to Level 4. WeRide is the only tech company in the world that holds driverless permits in China, the UAE, Singapore and the US, conducting autonomous driving R&D, tests and operations in over 30 cities of 10 countries around the world. WeRide has operated a self-driving fleet for more than 2,200 days.\nWeRide.ai Silicon Valley team is looking for an experienced and innovative data scientist for its growing\nmetrics team\nto support the development and validation of both L3+ Advanced Driver Assistance Systems (ADAS) and L4 Autonomous Driving (AD) Systems. The level depends on the candidate's experience and qualification.\nThe metrics team is at the forefront of accelerating the development and deployment of cutting-edge ADAS\/AV technologies. As a Senior Data Scientist on this team, you will play a pivotal role in ensuring the safety, reliability, and efficiency of our autonomous systems. You will be responsible for developing and implementing rigorous evaluation frameworks and advanced statistical methodologies to assess overall system performance, as well as the performance of critical sub-systems across software releases, and different territories. Your work will directly inform crucial engineering decisions, guide iterative improvements, and contribute to the successful commercialization of our ADAS\/AV stack.\nWhat You Will Do:\nDevelop Rigorous Evaluation Frameworks:\nDesign, develop, and implement advanced statistical frameworks for the comprehensive evaluation of ADAS\/AV system performance, with a strong emphasis on safety, compliance, and progress metrics.\nDefine and Monitor System Performance:\nDefine, measure, and monitor key performance indicators (KPIs) for the overall ADAS\/AV system. Develop automated data pipelines and reporting mechanisms to track these metrics across software releases.\nEvaluate Sub-system Performance:\nDefine and implement metrics to evaluate the performance of individual sub-systems. Utilize these metrics to provide actionable insights that guide and accelerate sub-system development and improvement.\nStatistical Analysis and Experimentation:\nApply advanced statistical techniques, including hypothesis testing, experimental design, and causal inference, to analyze complex behavioral data and derive robust insights into system performance and regressions between releases.\nPartner with Engineering Teams:\nCollaborate closely with Simulation, Systems Engineering, Product, and Software Development teams to integrate evaluation insights into the development lifecycle, inform release readiness, and ensure alignment on performance targets.\nTechnical Leadership and Mentorship:\nProvide technical leadership on complex data science problems, champion best practices in data analysis and statistical rigor, and mentor junior data scientists within the team.\nData Visualization and Communication:\nCreate compelling data visualizations and communicate complex analytical findings clearly and concisely to diverse audiences, ranging from technical engineers to senior leadership.\nRequirements:\nQuantitative Degree:\nMaster's degree in Data Science, Statistics, Mathematics, Engineering, Computer Science, or a related quantitative field.\nExtensive Industry Experience:\n3+ years of industry experience solving complex data science problems, with a strong focus on building and applying rigorous analytical and statistical models.\nAdvanced Statistical Expertise:\nDeep expertise in advanced statistical methods and their application in real-world settings, including experimental design, hypothesis testing, regression analysis, causal inference and time series analysis, etc.\nTechnical Problem Formulation:\nProven ability to translate ambiguous real-world challenges into clearly defined data science problems, identify appropriate methodologies, and deliver effective solutions.\nData Manipulation and Analysis:\nProficiency in using programming languages (e.g., Python, R) and SQL for data extraction, manipulation, and analysis.\nCommunication:\nExcellent verbal and written communication skills, with the ability to tailor technical explanations to various stakeholders.\nFlexibility:\nAbility to collaborate effectively with teams in different time zones.\nPreferred Qualifications:\nPhD degree in Data Science, Statistics, Mathematics, Engineering, Computer Science, or a related quantitative field.\n5+ years of industry experience solving complex data science problems, with a strong focus on building and applying rigorous analytical and statistical models.\nExperience with large-scale evaluation frameworks for complex software systems, particularly in autonomous driving or robotics.\nFamiliarity with ADAS\/AV system architectures and the behavioral challenges inherent in autonomous driving.\nKnowledge of simulation platforms and their role in data generation and system evaluation.\nSalary Range: Your base pay is one part of your total compensation package. For this position, the reasonably expected pay range is between $130,000 - $182,000 for the level at which this job has been scoped. Your base pay will depend on several factors, including your experience, qualifications, education, location, and skills. In the event that you are considered for a different level, a higher or lower pay range would apply. This position is also eligible for an annual performance bonus, equity, and a competitive benefits package.\nWeRide.ai offers competitive salary depending on the experience. Employee benefits include:\nPremium Medical, Dental and Vision Plan (No cost from employees or their families)\nFree Daily Breakfast, Lunch and Dinner\nPaid vacations and holidays\n401K plan\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n&nbsp;"
    },
    {
        "Title":"Senior Data Scientist",
        "Location":"Fremont, CA",
        "Company Name":"Weee! Inc",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=eaf9cc09104bc699&bb=Nm8sqwyT04Wia_3UsmYCTaXZxxxrD_JcbgOjW9VCezCor8dAEhynT7cUak-f5w3wAKxsRjrUyruDV6wIUkiH1LNH75tWUKZCGoATgwaQDLdQSquPg3SXE4B2kEYaxklrGCJeiDE5zrNew33sjsYdRQ%3D%3D&xkcb=SoCu67M3qk8DXQADNr0HbzkdCdPP&fccid=69e47485cd044190&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nTableau\n?\nYes\nNo\nEducation\nDo you have a\nMaster's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$115,000 - $165,000 a year\nJob type\nFull-time\n&nbsp;\nBenefits\nPulled from the full job description\n401(k) 4% Match\nHealth insurance\n401(k) matching\nVision insurance\nDental insurance\nCell phone reimbursement\n&nbsp;\nFull job description\nAbout Weee!\nWeee! is the largest and fastest-growing ethnic e-grocer in the United States, operating in one of the largest underserved categories in retail with affordable access to exciting ethnic food. By partnering with local suppliers, redesigning the value chain and leveraging social buying, Weee! is reshaping the grocery business entirely. You can read more about us on Business Insider, Reuters and TechCrunch.\nWeee! is headquartered in Fremont, CA, and is currently available coast to coast with exceptional growth (5x YoY) across geographies, categories and ethnicities. We have raised $800M+ in funding to date from leading investors including Softbank Vision Funds, DST, Blackstone, Tiger Global, Lightspeed Ventures, Goodwater Capital, XVC and iFly. The opportunity now is to join a rocketship as we prepare for the next stage of growth, and an eventual public listing.\nThis role is onsite 5 days a week in Fremont, CA\nAbout the role\nWe're looking for a Sr. Data Scientist with a passion for working with merchandising, pricing\/promotion finance\/accounting, and user behavioral data to help define strategy, guide operations, and KPIs and impact how we build experiences and products.\nResponsibilities:\nBuild dashboards, self-service tools including LLM agents, and ad hoc reports to analyze and present data associated with customer experience, business operations, and strategic decision making\nWork closely with the pricing team to test and measure different pricing\/promotion strategies, identify issues, trends, user behavior changes.\nConduct end-to-end analyses, including data gathering from large and complex data sets, processing, and analysis employing advanced statistical and ML methods, with ongoing deliverables to improve user experience\nIdentify actionable insights, suggest recommendations, and influence the direction of the business by effectively communicating metrics and results to stakeholders.\nPartner with Data Engineering to craft our data infrastructure investments in support of BI needs and ensure the proper tracking and quality of the data\nQualifications\nMS in Math, Statistics, or another closely-related quantitative field\n4+ years of Data Analysis experience in preferably e-commerce or customer-facing business\nExpert in data analysis, visualization, and communication, with prior full-time work experience, strongly preferred\nExperience creating dashboards\/visualizations using, e.g., Tableau (or similar)\nExpertise in SQL, and comfort with Python\nAbility to work in a fast-paced start-up environment and deliver excellent results, requiring minimal supervision. Cross-functional and can wear different hats at the same time\nBe a self-starter, detail-oriented, eager to learn, and motivated by a passion for developing the best possible solutions to problems\nStrong communication skills, and ability to work with multiple stakeholders.\nPreferred Qualifications\nExperience managing data pipelines\nExperience with Retail\/Ecommerce; especially merchandising\/operation analytics\nExperience with Finance\/Accounting Analytics\nExperience with building systematic solutions\nBenefits\nComprehensive health insurance package, including medical, dental, and vision. PPO\/HMO packages\n401k, 4% company match\nEquity and Bonus\nVacation, sick and holiday time off\nMonthly mobile stipend\nMonthly Weee! Points credits\nCompensation Range\nThe US base salary range for this full-time position is $115,000 - $165,000\nThis role may be eligible to discretionary bonus, incentives and benefits\nOur salary ranges are determined by role, level, and location\nThe range displayed on each job posting reflects the minimum and maximum base salary for new hires for the position across all US locations. Within the range, individual pay is determined by multiple factors like job-related skills, experience and work locations. Your recruiter can share more about the specific salary range during the hiring process.\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include any variable compensation elements.\nWeee! is an equal opportunity employer welcoming all qualified applicants regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. Discrimination or harassment of any kind is not tolerated at Weee!. If you need to inquire about an accommodation or need assistance with completing the application, please email us at applicantaccommodation@sayweee.com.\nFor more jobs and to find out more about Weee!, visit our career page: https:\/\/about.sayweee.com\/careers\nSoftbank Vision Funds\n&nbsp;"
    },
    {
        "Title":"Sr. Data Scientist",
        "Location":"Hybrid work in Redwood City, CA",
        "Company Name":"Attain",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=6dbca08bc358dfd4&bb=Nm8sqwyT04Wia_3UsmYCTS21VLIJpOeHcvs0sEvhppFJ2pqaBC15YJdWFTF7Kk7GUP5IjPG3ybAgoo4HWvoaOaUCEkeQZh_P1vw33ELd6weTF9n5v9rUy0_X6T6O-mfrsncxdiYqo_uG08G8i9l_sQ%3D%3D&xkcb=SoAa67M3qk8DXQADNr0GbzkdCdPP&fccid=0a404ea3cee62443&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nVersion control\n?\nYes\nNo\nEducation\nDo you have a\nDoctoral degree\n?\nYes\nNo\n&nbsp;\nFull job description\nAbout Attain\nBuilt for consumers and companies, alike\nIn a world driven by data, we believe consumers and businesses can coexist. Our founders had a vision to empower consumers to leverage their greatest asset—their data—in exchange for modern financial services. Built with this vision in mind, our platform allows consumers to access savings tools, earned wages and rewards without cost or hidden fees. In exchange, they give permission to use their real-time data for research, insights and targeted advertising.\nAt Attain, your contribution will help us build a more equitable and efficient data sharing ecosystem—whether helping consumers access modern financial services or businesses leverage data to achieve better outcomes. You'll have the opportunity to work directly with hands-on leaders and mission-driven individuals everyday.\nAttain Office Hybrid Schedule (where applicable):\nRedwood City, CA: Mondays (in-office for stand-ups, all-hands) and choice of three days between Tues-Friday\nChicago, IL & New York, NY:\n4 days in-office; 1 day remote\nAbout the role\nAttain is leveraging machine learning (ML) and data science-based products to take our business to the next level. To meet the growing needs of our business, we are searching for a Data Scientist to develop and apply novel machine learning approaches for new Ad-Tech products. This person will lead and experience first-hand how we transform machine learning models and algorithms into AI products for our customers, clients and partners.\nWhat a typical week might look like\nContribute to the development of our machine learning based Ad-Tech products, driving for speedy and outstanding execution\nLead by example and define best practices for robust and efficient machine learning service development that includes data processing, feature engineering, model development, model deployment, and in-production support, etc.\nCollaborate with a cross functional team of data scientists, engineers, product managers and business stakeholders to cost-effectively deliver AI services with quality, efficiency, and security\nContribute to the data science roadmap and priorities\nDevelop cutting edge data science models and algorithms to drive strategic investment decisions\nPreferred Qualifications\n5+ years working as a Data Scientist, Machine Learning Engineer, or similar role\nAdvanced degree in Computer Science, Statistics, Mathematics, or a related field (PhD preferred)\nStrong expertise in developing and deploying machine learning models (especially reinforcement learning models) in production\nSolid understanding of underlying mathematical foundation of machine learning models\nProficiency in Python\nExperience with cloud computing services or platform (GCP preferred)\nStrong SQL skills\nFamiliarity with version control and peer code review systems\nDemonstrated ability to learn and embrace new technologies, applications, and approaches\nWillingness to roll up your sleeves and wear multiple hats across the data science team, based on the needs of the business\nStrong written and verbal communication skills and the ability to explain technical topics to both technical and non-technical audiences\nWe are excited to hear from you.\nAt Attain, we are passionate about finding people to continuously help us grow our organization. We encourage you to apply, even if your experience doesn't match every detail on the job description. If we don't see something that immediately fits, we will keep your resume on file for future opportunities.\n&nbsp;"
    },
    {
        "Title":"Senior Data Scientist",
        "Location":"Hybrid work in San Jose, CA 95128",
        "Company Name":"Rich Data Co",
        "Link":"https:\/\/www.indeed.com\/rc\/clk?jk=64c52e2e3ea93e00&bb=Nm8sqwyT04Wia_3UsmYCTZB75AuKxMg6yQW0ZEMd8L4I0W52PiI3BOTEYDRmrX1z4FS2LkGeGdJXWpzjbyKmEWLhN_mXZOAG62Of6qv0pOfPay_8pOo7OBgQUo6a_DVVdouHZDfWZKV01METnL7Krw%3D%3D&xkcb=SoCH67M3qk8DXQADNr0FbzkdCdPP&fccid=03a901583cdfbbb4&vjs=3",
        "Description":"Profile insights\nFind out how your skills align with the job description\nSkills\nDo you have experience in\nStatistics\n?\nYes\nNo\nEducation\nDo you have a\nBachelor's degree\n?\nYes\nNo\n&nbsp;\nJob details\nPay\n$150,000 - $175,000 a year\nJob type\nFull-time\n&nbsp;\nBenefits\nPulled from the full job description\nPaid parental leave\nParental leave\nPaid time off\nPaid holidays\n&nbsp;\nFull job description\nAbout RDC.AI\nWhat started in 2016 with five people and two chairs has become a global force transforming how banks lend, grow, and protect their portfolios. RDC.AI helps business and commercial bankers know more, do more, and grow more by turning complex data into actionable intelligence. Our platform uniquely combines predictive and agentic AI to deliver transparent, explainable insights across the entire lending lifecycle from origination to monitoring. With built-in AI assistants and clear rationales for every recommendation, we empower banks across the globe to make confident decisions faster, launch innovative products, and generate tens of millions of dollars in measurable value. We're not just building AI - we're pioneering the future of intelligent banking, where every decision is explainable, every insight is actionable, and every outcome drives real impact.\nJoin the AI Revolution\nAward-Winning Innovation\nWinner: The Digital Banker's 2025 Global AI Innovation Awards (Best AI-Powered Platform)\nTwo-time finalist: American Chamber of Commerce Alliance Awards (Advanced Capabilities category)\nCutting-Edge Technology\nBuilding agentic AI solutions that solve real world banking problems\nWe are live in major banks, making millions of decisions, generating tens of millions in value\nHighest security accreditations: SOC2 Type 2 and ISO 27001 certified\n5-Star Employer Experience\nNamed \"Best Companies to Work For\" by HRD Australia (2023)\nHigh-performance teams working alongside industry-leading data scientists and credit experts\nVibrant, innovative culture that celebrates wins and solves complex problems together\nGlobal Impact & Growth\nFast-expanding presence across Australia, New Zealand, and North America\nHelping drive financial inclusion through fair, accessible, sustainable credit\nOpportunity to gain AI expertise and international experience in a rapidly growing market\nWork-Life Excellence\nFlexible working arrangements - work how's right for you\nCollaborative, agile environment where your contributions matter\nBe part of a mission that's transforming financial services globally\nRDC.AI North America offers:\nCompetitive benefits package (80% of premiums paid by RDC.ai)\n12 paid holidays\n20 days PTO per year + 5 paid personal or sick days per year\nPaid Maternity\/Paternity leave\nReady to shape the future of intelligent banking? Join us.\nAbout the Role\nRDC.AI is a cloud native AI Decisioning company and the Data Science function is key to our organizational success. As we look to expand in North America, we are looking for a Senior Data Scientist to join our North America team. A Sr Data Scientist will work closely with our customers on developing AI\/ML based solutions to solve complex credit-based decisions in the Business and Commercial lending space. Key responsibilities will include:\nDesign, present & document AI-based initiatives to our clients, typically banking and risk executives.\nDevelop use cases for clients with clear objectives and success criteria, matching our AI platform capabilities and client needs.\nAssist in developing data processing solutions and machine learning models to address the business objectives of our clients using RDC.AI platform.\nAssist in developing AI\/ML based solutions to be deployed on the RDC.AI platform for clients across use cases in Business and Commercial lending within North America\nHelp mentor and train junior data scientists on RDC.AI methodologies, AI\/ML best practices and credit risk modelling methodologies in the Business and Commercial lending space.\nAbout the Candidate\nEssential-Experience\/Skills\nBachelor’s degree in in Statistics, Mathematics, Physics, Computer Science, or other Quantitative related degree.\n5+ years of data science experience, ideally in credit risk or financial services.\nExperience developing and managing quantitative credit risk models including credit decisioning models.\nProgramming experience in Python for 3+ years.\nProgramming in SQL for 1+ years.\nKnowledge of data discovery, statistics, and data-driven model discovery, development, and validation, and tracking.\nAbility to learn and adapt to new or emerging modeling techniques (e.g., LLM, GenAI, LSTM, etc.)\nExperience presenting to technical, and non-technical stakeholders, including senior leadership.\nExcellent communication and client engagement skills.\nAbility to travel within North America (estimated 25% travel).\nDesired-Experience\/Skills\nAdvanced degree in Statistics, Mathematics, Physics, Computer Science, or other Quantitative related degree.\nExperience with commercial and\/or business lending.\nExperience working with traditional and non-traditional data sources such as transaction, accounting, and e-commerce data.\nUnderstanding the decision-making process behind the lending process.\nExperience in credit risk analysis, strategy design, and monitoring.\nExperience with additional programming languages is nice-to-have (e.g., Java, Scala, R, SAS, Perl, etc.)\n&nbsp;"
    }
]